betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr_ex.c
/**
  *
  * @file    apm32f4xx_dal_tmr_ex.c
  * @brief   TMR DAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Timer Extended peripheral:
  *           + Time Hall Sensor Interface Initialization
  *           + Time Hall Sensor Interface Start
  *           + Time Complementary signal break and dead time configuration
  *           + Time Master and Slave synchronization configuration
  *           + Timer remapping capabilities configuration
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2016 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  @verbatim
  ==============================================================================
                      ##### TMRER Extended features #####
  ==============================================================================
  [..]
    The Timer Extended features include:
    (#) Complementary outputs with programmable dead-time for :
        (++) Output Compare
        (++) PWM generation (Edge and Center-aligned Mode)
        (++) One-pulse mode output
    (#) Synchronization circuit to control the timer with external signals and to
        interconnect several timers together.
    (#) Break input to put the timer output signals in reset state or in a known state.
    (#) Supports incremental (quadrature) encoder and hall-sensor circuitry for
        positioning purposes

            ##### How to use this driver #####
  ==============================================================================
    [..]
     (#) Initialize the TMR low level resources by implementing the following functions
         depending on the selected feature:
           (++) Hall Sensor output : DAL_TMREx_HallSensor_MspInit()

     (#) Initialize the TMR low level resources :
        (##) Enable the TMR interface clock using __DAL_RCM_TMRx_CLK_ENABLE();
        (##) TMR pins configuration
            (+++) Enable the clock for the TMR GPIOs using the following function:
              __DAL_RCM_GPIOx_CLK_ENABLE();
            (+++) Configure these TMR pins in Alternate function mode using DAL_GPIO_Init();

     (#) The external Clock can be configured, if needed (the default clock is the
         internal clock from the APBx), using the following function:
         DAL_TMR_ConfigClockSource, the clock configuration should be done before
         any start function.

     (#) Configure the TMR in the desired functioning mode using one of the
         initialization function of this driver:
          (++) DAL_TMREx_HallSensor_Init() and DAL_TMREx_ConfigCommutEvent(): to use the
               Timer Hall Sensor Interface and the commutation event with the corresponding
               Interrupt and DMA request if needed (Note that One Timer is used to interface
               with the Hall sensor Interface and another Timer should be used to use
               the commutation event).

     (#) Activate the TMR peripheral using one of the start functions:
           (++) Complementary Output Compare : DAL_TMREx_OCN_Start(), DAL_TMREx_OCN_Start_DMA(),
                DAL_TMREx_OCN_Start_IT()
           (++) Complementary PWM generation : DAL_TMREx_PWMN_Start(), DAL_TMREx_PWMN_Start_DMA(),
                DAL_TMREx_PWMN_Start_IT()
           (++) Complementary One-pulse mode output : DAL_TMREx_OnePulseN_Start(), DAL_TMREx_OnePulseN_Start_IT()
           (++) Hall Sensor output : DAL_TMREx_HallSensor_Start(), DAL_TMREx_HallSensor_Start_DMA(),
                DAL_TMREx_HallSensor_Start_IT().

  @endverbatim
  *
  */

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @defgroup TMREx TMREx
  * @brief TMR Extended DAL module driver
  * @{
  */

#ifdef DAL_TMR_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static void TMR_DMADelayPulseNCplt(DMA_HandleTypeDef *hdma);
static void TMR_DMAErrorCCxN(DMA_HandleTypeDef *hdma);
static void TMR_CCxNChannelCmd(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t ChannelNState);

/* Exported functions --------------------------------------------------------*/
/** @defgroup TMREx_Exported_Functions TMR Extended Exported Functions
  * @{
  */

/** @defgroup TMREx_Exported_Functions_Group1 Extended Timer Hall Sensor functions
  * @brief    Timer Hall Sensor functions
  *
@verbatim
  ==============================================================================
                      ##### Timer Hall Sensor functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Initialize and configure TMR DAL Sensor.
    (+) De-initialize TMR DAL Sensor.
    (+) Start the Hall Sensor Interface.
    (+) Stop the Hall Sensor Interface.
    (+) Start the Hall Sensor Interface and enable interrupts.
    (+) Stop the Hall Sensor Interface and disable interrupts.
    (+) Start the Hall Sensor Interface and enable DMA transfers.
    (+) Stop the Hall Sensor Interface and disable DMA transfers.

@endverbatim
  * @{
  */
/**
  * @brief  Initializes the TMR Hall Sensor Interface and initialize the associated handle.
  * @note   When the timer instance is initialized in Hall Sensor Interface mode,
  *         timer channels 1 and channel 2 are reserved and cannot be used for
  *         other purpose.
  * @param  htmr TMR Hall Sensor Interface handle
  * @param  sConfig TMR Hall Sensor configuration structure
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMREx_HallSensor_Init(TMR_HandleTypeDef *htmr, TMR_HallSensor_InitTypeDef *sConfig)
{
  TMR_OC_InitTypeDef OC_Config;

  /* Check the TMR handle allocation */
  if (htmr == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_HALL_SENSOR_INTERFACE_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_COUNTER_MODE(htmr->Init.CounterMode));
  ASSERT_PARAM(IS_TMR_CLOCKDIVISION_DIV(htmr->Init.ClockDivision));
  ASSERT_PARAM(IS_TMR_AUTORELOAD_PRELOAD(htmr->Init.AutoReloadPreload));
  ASSERT_PARAM(IS_TMR_IC_POLARITY(sConfig->IC1Polarity));
  ASSERT_PARAM(IS_TMR_PERIOD(htmr, htmr->Init.Period));
  ASSERT_PARAM(IS_TMR_IC_PRESCALER(sConfig->IC1Prescaler));
  ASSERT_PARAM(IS_TMR_IC_FILTER(sConfig->IC1Filter));

  if (htmr->State == DAL_TMR_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    htmr->Lock = DAL_UNLOCKED;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
    /* Reset interrupt callbacks to legacy week callbacks */
    TMR_ResetCallback(htmr);

    if (htmr->HallSensor_MspInitCallback == NULL)
    {
      htmr->HallSensor_MspInitCallback = DAL_TMREx_HallSensor_MspInit;
    }
    /* Init the low level hardware : GPIO, CLOCK, NVIC */
    htmr->HallSensor_MspInitCallback(htmr);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC and DMA */
    DAL_TMREx_HallSensor_MspInit(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
  }

  /* Set the TMR state */
  htmr->State = DAL_TMR_STATE_BUSY;

  /* Configure the Time base in the Encoder Mode */
  TMR_Base_SetConfig(htmr->Instance, &htmr->Init);

  /* Configure the Channel 1 as Input Channel to interface with the three Outputs of the  Hall sensor */
  TMR_TI1_SetConfig(htmr->Instance, sConfig->IC1Polarity, TMR_ICSELECTION_TRC, sConfig->IC1Filter);

