betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr_ex.c
  /* Enable the TMR Capture/Compare 2 interrupt */
  __DAL_TMR_ENABLE_IT(htmr, TMR_IT_CC2);

  /* Enable the complementary One Pulse output channel and the Input Capture channel */
  TMR_CCxNChannelCmd(htmr->Instance, OutputChannel, TMR_CCxN_ENABLE);
  TMR_CCxChannelCmd(htmr->Instance, input_channel, TMR_CCx_ENABLE);

  /* Enable the Main Output */
  __DAL_TMR_MOE_ENABLE(htmr);

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Stops the TMR One Pulse signal generation in interrupt mode on the
  *         complementary channel.
  * @note OutputChannel must match the pulse output channel chosen when calling
  *       @ref DAL_TMR_OnePulse_ConfigChannel().
  * @param  htmr TMR One Pulse handle
  * @param  OutputChannel pulse output channel to disable
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMREx_OnePulseN_Stop_IT(TMR_HandleTypeDef *htmr, uint32_t OutputChannel)
{
  uint32_t input_channel = (OutputChannel == TMR_CHANNEL_1) ? TMR_CHANNEL_2 : TMR_CHANNEL_1;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCXN_INSTANCE(htmr->Instance, OutputChannel));

  /* Disable the TMR Capture/Compare 1 interrupt */
  __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC1);

  /* Disable the TMR Capture/Compare 2 interrupt */
  __DAL_TMR_DISABLE_IT(htmr, TMR_IT_CC2);

  /* Disable the complementary One Pulse output channel and the Input Capture channel */
  TMR_CCxNChannelCmd(htmr->Instance, OutputChannel, TMR_CCxN_DISABLE);
  TMR_CCxChannelCmd(htmr->Instance, input_channel, TMR_CCx_DISABLE);

  /* Disable the Main Output */
  __DAL_TMR_MOE_DISABLE(htmr);

  /* Disable the Peripheral */
  __DAL_TMR_DISABLE(htmr);

  /* Set the TMR  channels state */
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);

  /* Return function status */
  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup TMREx_Exported_Functions_Group5 Extended Peripheral Control functions
  * @brief    Peripheral Control functions
  *
@verbatim
  ==============================================================================
                    ##### Peripheral Control functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
      (+) Configure the commutation event in case of use of the Hall sensor interface.
      (+) Configure Output channels for OC and PWM mode.

      (+) Configure Complementary channels, break features and dead time.
      (+) Configure Master synchronization.
      (+) Configure timer remapping capabilities.

@endverbatim
  * @{
  */

/**
  * @brief  Configure the TMR commutation event sequence.
  * @note  This function is mandatory to use the commutation event in order to
  *        update the configuration at each commutation detection on the TRGI input of the Timer,
  *        the typical use of this feature is with the use of another Timer(interface Timer)
  *        configured in Hall sensor interface, this interface Timer will generate the
  *        commutation at its TRGO output (connected to Timer used in this function) each time
  *        the TI1 of the Interface Timer detect a commutation at its input TI1.
  * @param  htmr TMR handle
  * @param  InputTrigger the Internal trigger corresponding to the Timer Interfacing with the Hall sensor
  *          This parameter can be one of the following values:
  *            @arg TMR_TS_ITR0: Internal trigger 0 selected
  *            @arg TMR_TS_ITR1: Internal trigger 1 selected
  *            @arg TMR_TS_ITR2: Internal trigger 2 selected
  *            @arg TMR_TS_ITR3: Internal trigger 3 selected
  *            @arg TMR_TS_NONE: No trigger is needed
  * @param  CommutationSource the Commutation Event source
  *          This parameter can be one of the following values:
  *            @arg TMR_COMMUTATION_TRGI: Commutation source is the TRGI of the Interface Timer
  *            @arg TMR_COMMUTATION_SOFTWARE:  Commutation source is set by software using the COMG bit
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMREx_ConfigCommutEvent(TMR_HandleTypeDef *htmr, uint32_t  InputTrigger,
                                              uint32_t  CommutationSource)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_COMMUTATION_EVENT_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_INTERNAL_TRIGGEREVENT_SELECTION(InputTrigger));

  __DAL_LOCK(htmr);

  if ((InputTrigger == TMR_TS_ITR0) || (InputTrigger == TMR_TS_ITR1) ||
      (InputTrigger == TMR_TS_ITR2) || (InputTrigger == TMR_TS_ITR3))
  {
    /* Select the Input trigger */
    htmr->Instance->SMCTRL &= ~TMR_SMCTRL_TRGSEL;
    htmr->Instance->SMCTRL |= InputTrigger;
  }

  /* Select the Capture Compare preload feature */
  htmr->Instance->CTRL2 |= TMR_CTRL2_CCPEN;
  /* Select the Commutation event source */
  htmr->Instance->CTRL2 &= ~TMR_CTRL2_CCUSEL;
  htmr->Instance->CTRL2 |= CommutationSource;

  /* Disable Commutation Interrupt */
  __DAL_TMR_DISABLE_IT(htmr, TMR_IT_COM);

  /* Disable Commutation DMA request */
  __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_COM);

  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Configure the TMR commutation event sequence with interrupt.
  * @note  This function is mandatory to use the commutation event in order to
  *        update the configuration at each commutation detection on the TRGI input of the Timer,
  *        the typical use of this feature is with the use of another Timer(interface Timer)
  *        configured in Hall sensor interface, this interface Timer will generate the
  *        commutation at its TRGO output (connected to Timer used in this function) each time
  *        the TI1 of the Interface Timer detect a commutation at its input TI1.
  * @param  htmr TMR handle
  * @param  InputTrigger the Internal trigger corresponding to the Timer Interfacing with the Hall sensor
  *          This parameter can be one of the following values:
  *            @arg TMR_TS_ITR0: Internal trigger 0 selected
  *            @arg TMR_TS_ITR1: Internal trigger 1 selected
  *            @arg TMR_TS_ITR2: Internal trigger 2 selected
  *            @arg TMR_TS_ITR3: Internal trigger 3 selected
  *            @arg TMR_TS_NONE: No trigger is needed
  * @param  CommutationSource the Commutation Event source
  *          This parameter can be one of the following values:
  *            @arg TMR_COMMUTATION_TRGI: Commutation source is the TRGI of the Interface Timer
  *            @arg TMR_COMMUTATION_SOFTWARE:  Commutation source is set by software using the COMG bit
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMREx_ConfigCommutEvent_IT(TMR_HandleTypeDef *htmr, uint32_t  InputTrigger,
                                                 uint32_t  CommutationSource)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_COMMUTATION_EVENT_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_INTERNAL_TRIGGEREVENT_SELECTION(InputTrigger));

  __DAL_LOCK(htmr);

  if ((InputTrigger == TMR_TS_ITR0) || (InputTrigger == TMR_TS_ITR1) ||
      (InputTrigger == TMR_TS_ITR2) || (InputTrigger == TMR_TS_ITR3))
  {
    /* Select the Input trigger */
    htmr->Instance->SMCTRL &= ~TMR_SMCTRL_TRGSEL;
    htmr->Instance->SMCTRL |= InputTrigger;
  }

