betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr_ex.c
  /* Select the Capture Compare preload feature */
  htmr->Instance->CTRL2 |= TMR_CTRL2_CCPEN;
  /* Select the Commutation event source */
  htmr->Instance->CTRL2 &= ~TMR_CTRL2_CCUSEL;
  htmr->Instance->CTRL2 |= CommutationSource;

  /* Disable Commutation DMA request */
  __DAL_TMR_DISABLE_DMA(htmr, TMR_DMA_COM);

  /* Enable the Commutation Interrupt */
  __DAL_TMR_ENABLE_IT(htmr, TMR_IT_COM);

  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Configure the TMR commutation event sequence with DMA.
  * @note  This function is mandatory to use the commutation event in order to
  *        update the configuration at each commutation detection on the TRGI input of the Timer,
  *        the typical use of this feature is with the use of another Timer(interface Timer)
  *        configured in Hall sensor interface, this interface Timer will generate the
  *        commutation at its TRGO output (connected to Timer used in this function) each time
  *        the TI1 of the Interface Timer detect a commutation at its input TI1.
  * @note  The user should configure the DMA in his own software, in This function only the COMDE bit is set
  * @param  htmr TMR handle
  * @param  InputTrigger the Internal trigger corresponding to the Timer Interfacing with the Hall sensor
  *          This parameter can be one of the following values:
  *            @arg TMR_TS_ITR0: Internal trigger 0 selected
  *            @arg TMR_TS_ITR1: Internal trigger 1 selected
  *            @arg TMR_TS_ITR2: Internal trigger 2 selected
  *            @arg TMR_TS_ITR3: Internal trigger 3 selected
  *            @arg TMR_TS_NONE: No trigger is needed
  * @param  CommutationSource the Commutation Event source
  *          This parameter can be one of the following values:
  *            @arg TMR_COMMUTATION_TRGI: Commutation source is the TRGI of the Interface Timer
  *            @arg TMR_COMMUTATION_SOFTWARE:  Commutation source is set by software using the COMG bit
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMREx_ConfigCommutEvent_DMA(TMR_HandleTypeDef *htmr, uint32_t  InputTrigger,
                                                  uint32_t  CommutationSource)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_COMMUTATION_EVENT_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_INTERNAL_TRIGGEREVENT_SELECTION(InputTrigger));

  __DAL_LOCK(htmr);

  if ((InputTrigger == TMR_TS_ITR0) || (InputTrigger == TMR_TS_ITR1) ||
      (InputTrigger == TMR_TS_ITR2) || (InputTrigger == TMR_TS_ITR3))
  {
    /* Select the Input trigger */
    htmr->Instance->SMCTRL &= ~TMR_SMCTRL_TRGSEL;
    htmr->Instance->SMCTRL |= InputTrigger;
  }

  /* Select the Capture Compare preload feature */
  htmr->Instance->CTRL2 |= TMR_CTRL2_CCPEN;
  /* Select the Commutation event source */
  htmr->Instance->CTRL2 &= ~TMR_CTRL2_CCUSEL;
  htmr->Instance->CTRL2 |= CommutationSource;

  /* Enable the Commutation DMA Request */
  /* Set the DMA Commutation Callback */
  htmr->hdma[TMR_DMA_ID_COMMUTATION]->XferCpltCallback = TMREx_DMACommutationCplt;
  htmr->hdma[TMR_DMA_ID_COMMUTATION]->XferHalfCpltCallback = TMREx_DMACommutationHalfCplt;
  /* Set the DMA error callback */
  htmr->hdma[TMR_DMA_ID_COMMUTATION]->XferErrorCallback = TMR_DMAError;

  /* Disable Commutation Interrupt */
  __DAL_TMR_DISABLE_IT(htmr, TMR_IT_COM);

  /* Enable the Commutation DMA Request */
  __DAL_TMR_ENABLE_DMA(htmr, TMR_DMA_COM);

  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Configures the TMR in master mode.
  * @param  htmr TMR handle.
  * @param  sMasterConfig pointer to a TMR_MasterConfigTypeDef structure that
  *         contains the selected trigger output (TRGO) and the Master/Slave
  *         mode.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMREx_MasterConfigSynchronization(TMR_HandleTypeDef *htmr,
                                                        TMR_MasterConfigTypeDef *sMasterConfig)
{
  uint32_t tmpcr2;
  uint32_t tmpsmcr;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_MASTER_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_TRGO_SOURCE(sMasterConfig->MasterOutputTrigger));
  ASSERT_PARAM(IS_TMR_MSM_STATE(sMasterConfig->MasterSlaveMode));

  /* Check input state */
  __DAL_LOCK(htmr);

  /* Change the handler state */
  htmr->State = DAL_TMR_STATE_BUSY;

  /* Get the TMRx CTRL2 register value */
  tmpcr2 = htmr->Instance->CTRL2;

  /* Get the TMRx SMCTRL register value */
  tmpsmcr = htmr->Instance->SMCTRL;

  /* Reset the MMS Bits */
  tmpcr2 &= ~TMR_CTRL2_MMSEL;
  /* Select the TRGO source */
  tmpcr2 |=  sMasterConfig->MasterOutputTrigger;

  /* Update TMRx CTRL2 */
  htmr->Instance->CTRL2 = tmpcr2;

  if (IS_TMR_SLAVE_INSTANCE(htmr->Instance))
  {
    /* Reset the MSM Bit */
    tmpsmcr &= ~TMR_SMCTRL_MSMEN;
    /* Set master mode */
    tmpsmcr |= sMasterConfig->MasterSlaveMode;

    /* Update TMRx SMCTRL */
    htmr->Instance->SMCTRL = tmpsmcr;
  }

  /* Change the htmr state */
  htmr->State = DAL_TMR_STATE_READY;

  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Configures the Break feature, dead time, Lock level, OSSI/OSSR State
  *         and the AOE(automatic output enable).
  * @param  htmr TMR handle
  * @param  sBreakDeadTimeConfig pointer to a TMR_ConfigBreakDeadConfigTypeDef structure that
  *         contains the BDTR Register configuration  information for the TMR peripheral.
  * @note   Interrupts can be generated when an active level is detected on the
  *         break input, the break 2 input or the system break input. Break
  *         interrupt can be enabled by calling the @ref __DAL_TMR_ENABLE_IT macro.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMREx_ConfigBreakDeadTime(TMR_HandleTypeDef *htmr,
                                                TMR_BreakDeadTimeConfigTypeDef *sBreakDeadTimeConfig)
{
  /* Keep this variable initialized to 0 as it is used to configure BDTR register */
  uint32_t tmpbdtr = 0U;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_BREAK_INSTANCE(htmr->Instance));
  ASSERT_PARAM(IS_TMR_OSSR_STATE(sBreakDeadTimeConfig->OffStateRunMode));
  ASSERT_PARAM(IS_TMR_OSSI_STATE(sBreakDeadTimeConfig->OffStateIDLEMode));
  ASSERT_PARAM(IS_TMR_LOCK_LEVEL(sBreakDeadTimeConfig->LockLevel));
  ASSERT_PARAM(IS_TMR_DEADTIME(sBreakDeadTimeConfig->DeadTime));
  ASSERT_PARAM(IS_TMR_BREAK_STATE(sBreakDeadTimeConfig->BreakState));
  ASSERT_PARAM(IS_TMR_BREAK_POLARITY(sBreakDeadTimeConfig->BreakPolarity));
  ASSERT_PARAM(IS_TMR_AUTOMATIC_OUTPUT_STATE(sBreakDeadTimeConfig->AutomaticOutput));

  /* Check input state */
  __DAL_LOCK(htmr);

