betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_tmr_ex.c
  /* Set the Lock level, the Break enable Bit and the Polarity, the OSSR State,
     the OSSI State, the dead time value and the Automatic Output Enable Bit */

  /* Set the BDT bits */
  MODIFY_REG(tmpbdtr, TMR_BDT_DTS, sBreakDeadTimeConfig->DeadTime);
  MODIFY_REG(tmpbdtr, TMR_BDT_LOCKCFG, sBreakDeadTimeConfig->LockLevel);
  MODIFY_REG(tmpbdtr, TMR_BDT_IMOS, sBreakDeadTimeConfig->OffStateIDLEMode);
  MODIFY_REG(tmpbdtr, TMR_BDT_RMOS, sBreakDeadTimeConfig->OffStateRunMode);
  MODIFY_REG(tmpbdtr, TMR_BDT_BRKEN, sBreakDeadTimeConfig->BreakState);
  MODIFY_REG(tmpbdtr, TMR_BDT_BRKPOL, sBreakDeadTimeConfig->BreakPolarity);
  MODIFY_REG(tmpbdtr, TMR_BDT_AOEN, sBreakDeadTimeConfig->AutomaticOutput);


  /* Set TMRx_BDT */
  htmr->Instance->BDT = tmpbdtr;

  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @brief  Configures the TMRx Remapping input capabilities.
  * @param  htmr TMR handle.
  * @param  Remap specifies the TMR remapping source.
  *
  *         For TMR2, the parameter can have the following values:                   (**)
  *           @arg TMR_TMR2_TMR8_TRGO:  TMR2 ITR1 is connected to TMR8 TRGO          (*)
  *           @arg TMR_TMR2_ETH_PTP:    TMR2 ITR1 is connected to PTP trigger output (*)
  *           @arg TMR_TMR2_USBFS_SOF:  TMR2 ITR1 is connected to OTG FS SOF
  *           @arg TMR_TMR2_USBHS_SOF:  TMR2 ITR1 is connected to OTG FS SOF
  *
  *         For TMR5, the parameter can have the following values:
  *           @arg TMR_TMR5_GPIO:       TMR5 TI4 is connected to GPIO
  *           @arg TMR_TMR5_LSI:        TMR5 TI4 is connected to LSI
  *           @arg TMR_TMR5_LSE:        TMR5 TI4 is connected to LSE
  *           @arg TMR_TMR5_RTC:        TMR5 TI4 is connected to the RTC wakeup interrupt
  *
  *         For TMR11, the parameter can have the following values:
  *           @arg TMR_TMR11_GPIO:     TMR11 TI1 is connected to GPIO
  *           @arg TMR_TMR11_HSE:      TMR11 TI1 is connected to HSE_RTC clock
  *
  * @param  Remap specifies the TMR remapping source(Only for APM32F402/403xx device).
  *         For TMR2, the parameter can have the following values:                   (**)
  *           @arg TMR_TMR2_TMR8_TRGO:  TMR2 ITR1 is connected to TMR8 TRGO
  *           @arg TMR_TMR2_USBFS_SOF:  TMR2 ITR1 is connected to OTG FS SOF
  * 
  *         (*)  Value not defined in all devices. \n
  *         (**) Register not available in all devices.
  *
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_TMREx_RemapConfig(TMR_HandleTypeDef *htmr, uint32_t Remap)
{

  /* Check parameters */
  ASSERT_PARAM(IS_TMR_REMAP(htmr->Instance, Remap));

  __DAL_LOCK(htmr);

  /* Set the Timer remapping configuration */
  WRITE_REG(htmr->Instance->OPT, Remap);

  __DAL_UNLOCK(htmr);

  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup TMREx_Exported_Functions_Group6 Extended Callbacks functions
  * @brief    Extended Callbacks functions
  *
@verbatim
  ==============================================================================
                    ##### Extended Callbacks functions #####
  ==============================================================================
  [..]
    This section provides Extended TMR callback functions:
    (+) Timer Commutation callback
    (+) Timer Break callback

@endverbatim
  * @{
  */

/**
  * @brief  Hall commutation changed callback in non-blocking mode
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMREx_CommutCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMREx_CommutCallback could be implemented in the user file
   */
}
/**
  * @brief  Hall commutation changed half complete callback in non-blocking mode
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMREx_CommutHalfCpltCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMREx_CommutHalfCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Hall Break detection callback in non-blocking mode
  * @param  htmr TMR handle
  * @retval None
  */
__weak void DAL_TMREx_BreakCallback(TMR_HandleTypeDef *htmr)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(htmr);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_TMREx_BreakCallback could be implemented in the user file
   */
}
/**
  * @}
  */

/** @defgroup TMREx_Exported_Functions_Group7 Extended Peripheral State functions
  * @brief    Extended Peripheral State functions
  *
@verbatim
  ==============================================================================
                ##### Extended Peripheral State functions #####
  ==============================================================================
  [..]
    This subsection permits to get in run-time the status of the peripheral
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  Return the TMR Hall Sensor interface handle state.
  * @param  htmr TMR Hall Sensor handle
  * @retval DAL state
  */
DAL_TMR_StateTypeDef DAL_TMREx_HallSensor_GetState(TMR_HandleTypeDef *htmr)
{
  return htmr->State;
}

/**
  * @brief  Return actual state of the TMR complementary channel.
  * @param  htmr TMR handle
  * @param  ChannelN TMR Complementary channel
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1
  *            @arg TMR_CHANNEL_2: TMR Channel 2
  *            @arg TMR_CHANNEL_3: TMR Channel 3
  * @retval TMR Complementary channel state
  */
DAL_TMR_ChannelStateTypeDef DAL_TMREx_GetChannelNState(TMR_HandleTypeDef *htmr,  uint32_t ChannelN)
{
  DAL_TMR_ChannelStateTypeDef channel_state;

  /* Check the parameters */
  ASSERT_PARAM(IS_TMR_CCXN_INSTANCE(htmr->Instance, ChannelN));

  channel_state = TMR_CHANNEL_N_STATE_GET(htmr, ChannelN);

  return channel_state;
}
/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup TMREx_Private_Functions TMR Extended Private Functions
  * @{
  */

/**
  * @brief  TMR DMA Commutation callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
void TMREx_DMACommutationCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  /* Change the htmr state */
  htmr->State = DAL_TMR_STATE_READY;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->CommutationCallback(htmr);
#else
  DAL_TMREx_CommutCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
}

/**
  * @brief  TMR DMA Commutation half complete callback.
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
void TMREx_DMACommutationHalfCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  /* Change the htmr state */
  htmr->State = DAL_TMR_STATE_READY;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->CommutationHalfCpltCallback(htmr);
#else
  DAL_TMREx_CommutHalfCpltCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
}


/**
  * @brief  TMR DMA Delay Pulse complete callback (complementary channel).
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
static void TMR_DMADelayPulseNCplt(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  if (hdma == htmr->hdma[TMR_DMA_ID_CC1])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_1;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC2])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_2;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC3])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_3;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_3, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC4])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_4;

    if (hdma->Init.Mode == DMA_NORMAL)
    {
      TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_4, DAL_TMR_CHANNEL_STATE_READY);
    }
  }
  else
  {
    /* nothing to do */
  }

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->PWM_PulseFinishedCallback(htmr);
#else
  DAL_TMR_PWM_PulseFinishedCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
}

/**
  * @brief  TMR DMA error callback (complementary channel)
  * @param  hdma pointer to DMA handle.
  * @retval None
  */
static void TMR_DMAErrorCCxN(DMA_HandleTypeDef *hdma)
{
  TMR_HandleTypeDef *htmr = (TMR_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  if (hdma == htmr->hdma[TMR_DMA_ID_CC1])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_1;
    TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_1, DAL_TMR_CHANNEL_STATE_READY);
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC2])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_2;
    TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_2, DAL_TMR_CHANNEL_STATE_READY);
  }
  else if (hdma == htmr->hdma[TMR_DMA_ID_CC3])
  {
    htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_3;
    TMR_CHANNEL_N_STATE_SET(htmr, TMR_CHANNEL_3, DAL_TMR_CHANNEL_STATE_READY);
  }
  else
  {
    /* nothing to do */
  }

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  htmr->ErrorCallback(htmr);
#else
  DAL_TMR_ErrorCallback(htmr);
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

  htmr->Channel = DAL_TMR_ACTIVE_CHANNEL_CLEARED;
}

/**
  * @brief  Enables or disables the TMR Capture Compare Channel xN.
  * @param  TMRx to select the TMR peripheral
  * @param  Channel specifies the TMR Channel
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1
  *            @arg TMR_CHANNEL_2: TMR Channel 2
  *            @arg TMR_CHANNEL_3: TMR Channel 3
  * @param  ChannelNState specifies the TMR Channel CCxNE bit new state.
  *          This parameter can be: TMR_CCxN_ENABLE or TMR_CCxN_Disable.
  * @retval None
  */
static void TMR_CCxNChannelCmd(TMR_TypeDef *TMRx, uint32_t Channel, uint32_t ChannelNState)
{
  uint32_t tmp;

  tmp = TMR_CCEN_CC1NEN << (Channel & 0x1FU); /* 0x1FU = 31 bits max shift */

  /* Reset the CCxNE Bit */
  TMRx->CCEN &=  ~tmp;

  /* Set or reset the CCxNE Bit */
  TMRx->CCEN |= (uint32_t)(ChannelNState << (Channel & 0x1FU)); /* 0x1FU = 31 bits max shift */
}
/**
  * @}
  */

#endif /* DAL_TMR_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
